---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussLayoutOverlapedCurves
source: html/dcd23393-04f4-71a4-01e5-89e0b0239e55.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussLayoutOverlapedCurves Property

The current transformation of this specific truss layout will some sub members to overlap.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussLayoutOverlapedCurves { get; }
```